Revit 2027 API
IFCParameterTemplate.GetActiveTemplate Method
 Gets the active mapping template element in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCParameterTemplate GetActiveTemplate(
	Document document
)
Public Shared Function GetActiveTemplate (
	document As Document
) As IFCParameterTemplate
public:
static IFCParameterTemplate^ GetActiveTemplate(
	Document^ document
)
static member GetActiveTemplate :
        document : Document -> IFCParameterTemplate
Parameters
document Document
 The document to find the active mapping template.
Return Value
IFCParameterTemplate
 The active mapping template, or null if none.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 New documents have no active mapping template and it implies in-session template usage.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace